#include "Pub_Delay.h"
#include <stdint.h>

static INT16U SYSCLK = 0;;

volatile INT32U gul_SystemTimerMs = 0;
void Pub_SystemTick_Init(void)
{
    //RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    SysTick_Config(SystemCoreClock / 100);
	//DWT_Init(72);
}


//==================================================================================================
//| 函数名称 | p_CylSub()
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 长整型数据比较函数
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | x -- 长整型数据
//|          | y -- 长整型数据
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 差值
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 | gao,09.4.2
//==================================================================================================
INT32U p_CylSub(INT32U _ul_X, INT32U _ul_Y)
{
    if(_ul_X >= _ul_Y)
    {
        return (_ul_X - _ul_Y);
    }
    else
    {
        if((_ul_Y - _ul_X) < 0x10000000UL)   //此时为异常值情况,返回0
        {
             return (0);
        }
        else                       //此时计数器溢出,返回溢出差值
        {
              return ((INT32U)0xFFFFFFFF - _ul_Y + _ul_X);
        }
    }
}


//==================================================================================================
//| 函数名称 | StartTickMs()
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 启动毫秒级的Tick精确计时(记录当前Tick时钟)
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | _pul_Ms: 32位的数据指针
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 | gao,09.4.2
//==================================================================================================
void StartTickMs(INT32U *_pul_Ms)
{
    *_pul_Ms = gul_SystemTimerMs;
}

//==================================================================================================
//| 函数名称 | GetTickMs()
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 获取毫秒级的Tick精确计时(计算Tick时钟的差值)
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | _pul_Ms: 32位的数据指针
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 | gao,09.4.2
//==================================================================================================
INT32U GetTickMs(INT32U *_pul_Ms)
{
    INT32U  _ul_Temp;

    _ul_Temp = gul_SystemTimerMs;
    _ul_Temp = p_CylSub(_ul_Temp, *_pul_Ms);

    return(_ul_Temp);
}

void Pub_Delay_Init(void)
{

}
void Delay_Us(INT32U _ul_us)
{
	DWT_Delay_Us(_ul_us);
}
void Delay_Ms(INT32U _ul_ms)
{
	DWT_Delay_Us(_ul_ms * 1000);
}


   
void DWT_Init(INT16U uin_sys_clk) 
{   
	DEMCR |= TRCENA;   
	DWT_CTRL |= CYCCNTENA;      
	SYSCLK = uin_sys_clk; // 保存当前系统的时钟周期，eg. 72,000,000(72MHz).  
}   // 微秒延时 
void DWT_Delay_Us(INT32U _ul_us) 
{   
	INT16U _uin_ticks_start, _uin_ticks_end,_uin_ticks_delay;      
	_uin_ticks_start = DWT_CYCCNT;      
	if(!SYSCLK)
	{
		DWT_Init(MY_MCU_SYSCLK);
	}
	_uin_ticks_delay = (_ul_us * ( SYSCLK / (1000 * 1000))); // 将微秒数换算成滴答数                
	_uin_ticks_end = _uin_ticks_start + _uin_ticks_delay;      
	if(_uin_ticks_end > _uin_ticks_start)   
	{     
		while( DWT_CYCCNT < _uin_ticks_end);   
	}   
	else // 计数溢出，翻转   
	{     
		while( DWT_CYCCNT >= _uin_ticks_end); // 翻转后的值不会比ticks_end小     
		while( DWT_CYCCNT < _uin_ticks_end);  
	} 
}



